Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.prompt.type.title
source: Type
ar: النوع
de: Typ
es: Tipo
id: Tipe
it: Tipo
ja: タイプ
ko: 유형
pl: Typ
pt_br: Tipo
ru: Тип
tr: Tür
uk: Тип
vi: Loại
zh_hans: 类型
zh_hant: 類型

# rag.workspace.prompt.user
source: User Prompt
ar: مطالبة المستخدم
de: Benutzer-Prompt
es: Mensaje del usuario
fr: Invite utilisateur
id: Prompt Pengguna
it: Prompt utente
ja: ユーザープロンプト
ko: 사용자 프롬프트
nl: Gebruikersprompt
pl: Prompt użytkownika
pt_br: Prompt do Usuário
ru: Подсказка пользователя
tr: Kullanıcı İstemi
uk: Підказка користувача
vi: Lời nhắc Người dùng
zh_hans: User 提示词
zh_hant: User 提示詞

# rag.workspace.recentConversations
source: Recent Q&A
ar: الأسئلة والأجوبة الأخيرة
de: Letzte F&A
es: Preguntas y respuestas recientes
fr: Q&R récentes
id: Tanya Jawab Terbaru
it: Q&A recenti
ja: 最近のQ&A
ko: 최근 Q&A
nl: Recente V&A
pl: Ostatnie pytania i odpowiedzi
pt_br: Perguntas e Respostas Recentes
ru: Недавние вопросы и ответы
tr: Son Soru-Cevaplar
uk: Нещодавні Q&A
vi: Hỏi & Đáp gần đây
zh_hans: 最近问答
zh_hant: 最近問答

# rag.workspace.remote.confirmTitle
source: Use temporary GitHub context for this answer?
ar: استخدام سياق GitHub المؤقت لهذه الإجابة؟
de: Temporären GitHub-Kontext für diese Antwort verwenden?
es: ¿Usar contexto temporal de GitHub para esta respuesta?
fr: Utiliser le contexte GitHub temporaire pour cette réponse ?
id: Gunakan konteks GitHub sementara untuk jawaban ini?
it: Usare contesto GitHub temporaneo per questa risposta?
ja: この回答に一時的なGitHubコンテキストを使用しますか？
ko: 이 답변에 임시 GitHub 컨텍스트를 사용하시겠습니까?
nl: Tijdelijke GitHub-context gebruiken voor dit antwoord?
pl: Użyć tymczasowego kontekstu GitHub dla tej odpowiedzi?
pt_br: Usar contexto temporário do GitHub para esta resposta?
ru: Использовать временный контекст GitHub для этого ответа?
tr: Bu yanıt için geçici GitHub bağlamı kullanılsın mı?
uk: Використати тимчасовий контекст GitHub для цієї відповіді?
vi: Sử dụng ngữ cảnh GitHub tạm thời cho câu trả lời này?
zh_hans: 本轮回答是否使用 GitHub 临时上下文？
zh_hant: 本輪回答是否使用 GitHub 臨時上下文？

# rag.workspace.remote.continue
source: Continue
ar: متابعة
de: Fortfahren
es: Continuar
fr: Continuer
id: Lanjutkan
it: Continua
ja: 続行
ko: 계속
nl: Doorgaan
pl: Kontynuuj
pt_br: Continuar
ru: Продолжить
tr: Devam Et
uk: Продовжити
vi: Tiếp tục
zh_hans: 继续
zh_hant: 繼續

# rag.workspace.remote.skip
source: Skip
ar: تخطي
de: Überspringen
es: Saltar
fr: Passer
id: Lewati
it: Salta
ja: スキップ
ko: 건너뛰기
nl: Overslaan
pl: Pomiń
pt_br: Pular
ru: Пропустить
tr: Atla
uk: Пропустити
vi: Bỏ qua
zh_hans: 跳过
zh_hant: 跳過

# rag.workspace.repoContext.cache
source: Preparation
ar: التحضير
de: Vorbereitung
es: Preparación
fr: Préparation
id: Persiapan
it: Preparazione
ja: 準備
ko: 준비
nl: Voorbereiding
pl: Przygotowanie
pt_br: Preparação
ru: Подготовка
tr: Hazırlık
uk: Підготовка
vi: Chuẩn bị
zh_hans: 生成方式
zh_hant: 生成方式

# rag.workspace.repoContext.cache.generated
source: Generated this turn
ar: تم إنشاؤه هذا الدور
de: Diesen Abschnitt generiert
es: Generado en este turno
fr: Généré ce tour
id: Dihasilkan giliran ini
it: Generato questo turno
ja: 今回生成
ko: 이 턴에 생성됨
nl: Deze beurt gegenereerd
pl: Wygenerowano w tej turze
pt_br: Gerado neste turno
ru: Сгенерировано в этом витке
tr: Bu tur oluşturuldu
uk: Згенеровано цього кроку
vi: Đã tạo lượt này
zh_hans: 本轮生成
zh_hant: 本輪生成

# rag.workspace.repoContext.cache.hit
source: Reused cache
ar: ذاكرة تخزين مؤقت معاد استخدامها
de: Cache wiederverwendet
es: Caché reutilizada
fr: Cache réutilisé
id: Cache digunakan kembali
it: Cache riutilizzata
ja: キャッシュ再利用
ko: 캐시 재사용
nl: Cache hergebruikt
pl: Użyto pamięci podręcznej
pt_br: Cache reutilizado
ru: Использован кеш
tr: Önbellek kullanıldı
uk: Використано кеш
vi: Đã sử dụng bộ nhớ đệm
zh_hans: 复用缓存
zh_hant: 重複使用快取

# rag.workspace.repoContext.commit
source: Commit
ar: الالتزام
ja: コミット
ko: 커밋
ru: Коммит
tr: İşleme
uk: Коміт
vi: Cam kết

# rag.workspace.repoContext.copy
source: Copy context.xml
ar: نسخ context.xml
de: context.xml kopieren
es: Copiar context.xml
fr: Copier context.xml
id: Salin context.xml
it: Copia context.xml
ja: context.xmlをコピー
ko: context.xml 복사
nl: Kopieer context.xml
pl: Kopiuj context.xml
pt_br: Copiar context.xml
ru: Копировать context.xml
tr: context.xml'i kopyala
uk: Копіювати context.xml
vi: Sao chép context.xml
zh_hans: 复制 context.xml
zh_hant: 複製 context.xml

# rag.workspace.repoContext.hash
source: Content hash
ar: تجزئة المحتوى
de: Inhalts-Hash
es: Hash de contenido
fr: Hash du contenu
id: Hash konten
it: Hash del contenuto
ja: コンテンツハッシュ
ko: 콘텐츠 해시
nl: Inhoudshash
pl: Skrót zawartości
pt_br: Hash do conteúdo
ru: Хеш содержимого
tr: İçerik hash'i
uk: Хеш вмісту
vi: Hàm băm nội dung
zh_hans: 内容哈希
zh_hant: 內容雜湊

# rag.workspace.repoContext.historyUnavailable
source: The historical XML is unavailable or no longer matches this commit and hash.
ar: XML التاريخي غير متاح أو لم يعد يطابق هذا الالتزام والتجزئة.
de: Das historische XML ist nicht verfügbar oder stimmt nicht mehr mit diesem Commit und Hash überein.
es: El XML histórico no está disponible o ya no coincide con este commit y hash.
fr: Le XML historique est indisponible ou ne correspond plus à ce commit et hash.
id: XML historis tidak tersedia atau tidak lagi cocok dengan commit dan hash ini.
it: L'XML storico non è disponibile o non corrisponde più a questo commit e hash.
ja: 過去のXMLが利用できないか、このコミットとハッシュに一致しなくなりました。
ko: 기록 XML을 사용할 수 없거나 더 이상 이 커밋 및 해시와 일치하지 않습니다.
nl: De historische XML is niet beschikbaar of komt niet meer overeen met deze commit en hash.
pl: Historyczny XML jest niedostępny lub nie pasuje już do tego commitu i skrótu.
pt_br: O XML histórico está indisponível ou não corresponde mais a este commit e hash.
ru: Исторический XML недоступен или больше не соответствует этому коммиту и хешу.
tr: Geçmiş XML kullanılamıyor veya artık bu işleme ve hash ile eşleşmiyor.
uk: Історичний XML недоступний або більше не відповідає цьому коміту та хешу.
vi: XML lịch sử không khả dụng hoặc không còn khớp với cam kết và hàm băm này.
zh_hans: 历史 XML 不可用，或已不再匹配本轮 commit 与内容哈希。
zh_hant: 歷史 XML 不可用，或已不再符合此 commit 與內容雜湊。

# rag.workspace.repoContext.planNote
source: Build and inject the selected project's code XML before web search
ar: بناء وحقن XML كود المشروع المحدد قبل البحث على الويب
de: Code-XML des ausgewählten Projekts vor der Websuche erstellen und einfügen
es: Construir e inyectar el XML del código del proyecto seleccionado antes de la búsqueda web
fr: Construire et injecter le code XML du projet sélectionné avant la recherche web
id: Bangun dan suntikkan XML kode proyek yang dipilih sebelum pencarian web
it: Costruisci e inietta l'XML del codice del progetto selezionato prima della ricerca web
ja: ウェブ検索の前に選択したプロジェクトのコードXMLを構築して挿入
ko: 웹 검색 전에 선택한 프로젝트의 코드 XML을 빌드하고 주입합니다.
nl: Bouw en injecteer de code-XML van het geselecteerde project vóór webzoekopdracht
pl: Zbuduj i wstaw kod XML wybranego projektu przed wyszukiwaniem internetowym
pt_br: Construir e injetar o XML do código do projeto selecionado antes da pesquisa na web
ru: Создать и вставить XML-код выбранного проекта перед веб-поиском
tr: Web aramasından önce seçilen projenin kod XML'ini oluştur ve ekle
uk: Створити та вставити XML коду вибраного проєкту перед веб-пошуком
vi: Xây dựng và chèn mã XML của dự án đã chọn trước khi tìm kiếm web
zh_hans: 在联网搜索前生成并注入选中项目的代码 XML
zh_hant: 在網路搜尋前生成並注入選取專案的程式碼 XML

# rag.workspace.repoContext.planReason
source: Deep thinking was enabled for the selected project
ar: تم تمكين التفكير العميق للمشروع المحدد
de: Deep Thinking war für das ausgewählte Projekt aktiviert
es: El pensamiento profundo estaba habilitado para el proyecto seleccionado
fr: La réflexion approfondie était activée pour le projet sélectionné
id: Pemikiran mendalam diaktifkan untuk proyek yang dipilih
it: Il pensiero profondo era abilitato per il progetto selezionato
ja: 選択したプロジェクトで深い思考が有効でした
ko: 선택한 프로젝트에 대해 심층 사고가 활성화되었습니다.
nl: Diep denken was ingeschakeld voor het geselecteerde project
pl: Głębokie myślenie było włączone dla wybranego projektu
pt_br: O pensamento profundo foi ativado para o projeto selecionado
ru: Глубокое мышление было включено для выбранного проекта
tr: Seçilen proje için derin düşünme etkinleştirildi
uk: Глибоке мислення ввімкнено для вибраного проєкту
vi: Suy nghĩ sâu đã được bật cho dự án đã chọn
zh_hans: 已为选中的单项目开启深度思考
zh_hant: 已為選取的單一專案啟用深度思考

# rag.workspace.repoContext.projection
source: Window fit
ar: ملاءمة النافذة
de: Fensteranpassung
es: Ajuste de ventana
fr: Ajustement de la fenêtre
id: Kesesuaian jendela
it: Adattamento finestra
ja: ウィンドウ適合
ko: 창 맞춤
nl: Vensterpassing
pl: Dopasowanie okna
pt_br: Ajuste à janela
ru: Подгонка окна
tr: Pencere uyumu
uk: Вікно вміщує
vi: Khớp cửa sổ
zh_hans: 窗口适配
zh_hant: 視窗適配

# rag.workspace.repoContext.projection.original
source: Full XML fit
ar: XML كامل مناسب
de: Vollständige XML-Anpassung
es: Ajuste XML completo
fr: Ajustement XML complet
it: Adattamento XML completo
ja: 全XML適合
ko: 전체 XML 맞춤
nl: Volledige XML-passend
pl: Pełny XML dopasowania
pt_br: XML completo
ru: Полный XML-фит
tr: Tam XML uyumu
uk: Повний XML-відповідник
vi: Toàn bộ XML phù hợp
zh_hans: 完整装入
zh_hant: 完整裝入

# rag.workspace.repoContext.projection.projected
source: Trimmed to fit
ar: مُقتطع ليتناسب
de: Zugeschnitten
es: Recortado para ajustar
fr: Réduit pour s'adapter
id: Dipangkas agar pas
it: Ritagliato per adattarsi
ja: トリミング済み
ko: 맞춤에 맞게 자름
nl: Ingekort om te passen
pl: Przycięty do dopasowania
pt_br: Recortado para caber
ru: Обрезано для подгонки
tr: Sığacak şekilde kırpıldı
uk: Обрізано для відповідності
vi: Đã cắt gọn để vừa
zh_hans: 已裁剪装入
zh_hant: 已裁剪裝入

# rag.workspace.repoContext.projectionReason
source: Window fit reason
ar: سبب ملاءمة النافذة
de: Grund der Fensteranpassung
es: Motivo del ajuste de ventana
fr: Raison de l'ajustement de la fenêtre
id: Alasan penyesuaian jendela
it: Motivo dell'adattamento finestra
ja: ウィンドウ適合理由
ko: 창 맞춤 이유
nl: Reden voor vensterpassing
pl: Powód dopasowania okna
pt_br: Motivo do ajuste à janela
ru: Причина подгонки окна
tr: Pencere sığdırma nedeni
uk: Причина підгонки вікна
vi: Lý do vừa cửa sổ
zh_hans: 适配原因
zh_hant: 適配原因

# rag.workspace.repoContext.title
source: Project code XML
ar: XML كود المشروع
de: Projektcode-XML
es: XML del código del proyecto
fr: XML du code du projet
id: XML kode proyek
it: XML del codice progetto
ja: プロジェクトコードXML
ko: 프로젝트 코드 XML
pl: XML kodu projektu
pt_br: XML do código do projeto
ru: XML кода проекта
tr: Proje kodu XML
uk: XML коду проєкту
vi: XML mã dự án
zh_hans: 项目代码 XML
zh_hant: 專案程式碼 XML

# rag.workspace.repoContext.tokens
source: Tokens
ar: الرموز
fr: Jetons
id: Token
it: Token
ja: トークン
ko: 토큰
pl: Tokeny
ru: Токены
tr: Tokenlar
uk: Токени
vi: Token

# rag.workspace.repoContext.xml
source: context.xml sent this turn
ar: context.xml المُرسل هذا الدور
de: context.xml in dieser Runde gesendet
es: context.xml enviado esta vez
fr: context.xml envoyé ce tour
id: context.xml dikirim giliran ini
it: context.xml inviato in questo turno
ja: 今回送信したcontext.xml
ko: 이번 턴에 전송된 context.xml
nl: context.xml deze beurt verzonden
pl: context.xml wysłany w tej turze
pt_br: context.xml enviado neste turno
ru: context.xml отправлен в этом раунде
tr: Bu turda gönderilen context.xml
uk: context.xml надіслано цього разу
vi: context.xml đã gửi lần này
zh_hans: 本轮发送的 context.xml
zh_hant: 本輪傳送的 context.xml

# rag.workspace.repoContext.xml.expand
source: Open the complete context.xml
ar: فتح context.xml الكامل
de: Vollständige context.xml öffnen
es: Abrir el context.xml completo
fr: Ouvrir le context.xml complet
id: Buka context.xml lengkap
it: Apri il context.xml completo
ja: 完全なcontext.xmlを開く
ko: 전체 context.xml 열기
nl: Open de volledige context.xml
pl: Otwórz pełny plik context.xml
pt_br: Abrir o context.xml completo
ru: Открыть полный context.xml
tr: Tam context.xml dosyasını aç
uk: Відкрити повний context.xml
vi: Mở context.xml đầy đủ
zh_hans: 打开完整 context.xml
zh_hant: 開啟完整 context.xml

# rag.workspace.repoMode.exclude
source: Exclude selected
ar: استبعاد المُحدد
de: Ausgewählte ausschließen
es: Excluir seleccionados
fr: Exclure la sélection
id: Kecualikan yang dipilih
it: Escludi selezionati
ja: 選択を除外
ko: 선택 항목 제외
nl: Geselecteerde uitsluiten
pl: Wyklucz zaznaczone
pt_br: Excluir selecionados
ru: Исключить выбранное
tr: Seçilenleri hariç tut
uk: Виключити вибране
vi: Loại trừ mục đã chọn
zh_hans: 排除已选仓库
zh_hant: 排除已選倉庫

# rag.workspace.repoMode.only
source: Only selected
ar: المُحدد فقط
de: Nur ausgewählte
es: Solo seleccionados
fr: Uniquement la sélection
id: Hanya yang dipilih
it: Solo selezionati
ja: 選択のみ
ko: 선택 항목만
nl: Alleen geselecteerde
pl: Tylko zaznaczone
pt_br: Apenas selecionados
ru: Только выбранное
tr: Yalnızca seçilenler
uk: Тільки вибране
vi: Chỉ mục đã chọn
zh_hans: 仅已选仓库
zh_hant: 僅已選倉庫

# rag.workspace.repoMode.prefer
source: Prefer selected
ar: تفضيل المُحدد
de: Ausgewählte bevorzugen
es: Preferir seleccionados
fr: Préférer la sélection
id: Utamakan yang dipilih
it: Preferisci selezionati
ja: 選択を優先
ko: 선택 항목 선호
nl: Geselecteerde verkiezen
pl: Preferuj zaznaczone
pt_br: Preferir selecionados
ru: Предпочесть выбранное
tr: Seçilenleri tercih et
uk: Надати перевагу вибраному
vi: Ưu tiên mục đã chọn
zh_hans: 优先已选仓库
zh_hant: 優先已選倉庫

# rag.workspace.rerank.apiKey
source: API Token
ar: رمز API
es: Token de API
fr: Jeton API
id: Token API
it: Token API
ja: APIトークン
ko: API 토큰
pl: Token API
pt_br: Token da API
ru: API-токен
uk: API-токен

# rag.workspace.rerank.apiKey.hint
source: Optional Bearer token. It is stored in Keychain and never included in debug records.
ar: رمز Bearer اختياري. يُخزّن في Keychain ولا يُدرج في سجلات التصحيح.
de: Optionaler Bearer-Token. Wird im Schlüsselbund gespeichert und nie in Debug-Aufzeichnungen aufgenommen.
es: Token Bearer opcional. Se almacena en el Llavero y nunca se incluye en registros de depuración.
fr: Jeton Bearer facultatif. Stocké dans le trousseau, jamais inclus dans les enregistrements de débogage.
id: Token Bearer opsional. Disimpan di Keychain dan tidak pernah disertakan dalam catatan debug.
it: Token Bearer opzionale. Viene archiviato nel Portachiavi e mai incluso nei registri di debug.
ja: オプションのBearerトークン。キーチェーンに保存され、デバッグ記録には含まれません。
ko: 선택적 Bearer 토큰입니다. 키체인에 저장되며 디버그 기록에 포함되지 않습니다.
nl: Optionele Bearer-token. Opgeslagen in Sleutelhanger en nooit opgenomen in foutopsporingsgegevens.
pl: Opcjonalny token Bearer. Jest przechowywany w pęku kluczy i nigdy nie jest dołączany do rekordów debugowania.
pt_br: Token Bearer opcional. Armazenado nas Chaves e nunca incluído em registros de depuração.
ru: Необязательный Bearer-токен. Хранится в связке ключей и никогда не включается в отладочные записи.
tr: İsteğe bağlı Bearer token. Keychain'de saklanır ve hata kayıtlarına asla dahil edilmez.
uk: Необов'язковий Bearer-токен. Зберігається у зв'язці ключів і ніколи не включається до записів налагодження.
vi: Bearer token tùy chọn. Được lưu trong Keychain và không bao giờ có trong bản ghi gỡ lỗi.
zh_hans: 可选的 Bearer Token；仅存入 Keychain，不会写入调试记录。
zh_hant: 可選的 Bearer Token；僅存入鑰匙圈，不會寫入除錯記錄。

# rag.workspace.rerank.candidateLimit
source: Candidate Limit
ar: حد المُرشحين
de: Kandidatenlimit
es: Límite de candidatos
fr: Limite de candidats
id: Batas Kandidat
it: Limite candidati
ja: 候補上限
ko: 후보 제한
nl: Kandidaatlimiet
pl: Limit kandydatów
pt_br: Limite de candidatos
ru: Лимит кандидатов
tr: Aday Limiti
uk: Ліміт кандидатів
vi: Giới hạn ứng viên
zh_hans: 候选数上限
zh_hant: 候選數上限

# rag.workspace.rerank.candidateLimit.hint
source: Maximum number of fused retrieval chunks sent to Rerank for reordering. Example: if retrieval finds 100 chunks and this is set to 24, only the top 24 fused chunks are sent to Rerank. The Final Chunk Limit then selects the chunks used for the LLM answer.
ar: الحد الأقصى لعدد أجزاء الاسترجاع المُدمجة المُرسلة إلى Rerank لإعادة الترتيب. مثال: إذا وجد الاسترجاع 100 جزء وتم تعيين هذا إلى 24، فسيتم إرسال أفضل 24 جزءًا مُدمجًا فقط إلى Rerank. ثم يختار حد الأجزاء النهائي الأجزاء المُستخدمة لإجابة LLM.
de: Maximale Anzahl fusionierter Abruf-Chunks, die zum Neuordnen an Rerank gesendet werden. Beispiel: Wenn der Abruf 100 Chunks findet und dies auf 24 gesetzt ist, werden nur die besten 24 fusionierten Chunks an Rerank gesendet. Das endgültige Chunk-Limit wählt dann die für die LLM-Antwort verwendeten Chunks aus.
es: Número máximo de fragmentos de recuperación fusionados enviados a Rerank para reordenar. Ejemplo: si la recuperación encuentra 100 fragmentos y esto está configurado en 24, solo los 24 fragmentos fusionados principales se envían a Rerank. El Límite de fragmentos finales luego selecciona los fragmentos utilizados para la respuesta del LLM.
fr: Nombre maximum de fragments de récupération fusionnés envoyés au reclassement. Exemple : si la récupération trouve 100 fragments et que ce champ est réglé sur 24, seuls les 24 meilleurs fragments fusionnés sont envoyés au reclassement. La limite finale de fragments sélectionne ensuite les fragments utilisés pour la réponse du LLM.
id: Jumlah maksimum potongan retrieval gabungan yang dikirim ke Rerank untuk diurutkan ulang. Contoh: jika retrieval menemukan 100 potongan dan ini diatur ke 24, hanya 24 potongan gabungan teratas yang dikirim ke Rerank. Batas Potongan Akhir kemudian memilih potongan yang digunakan untuk jawaban LLM.
it: Numero massimo di blocchi di recupero fusi inviati a Rerank per il riordino. Esempio: se il recupero trova 100 blocchi e questo è impostato a 24, solo i primi 24 blocchi fusi vengono inviati a Rerank. Il Limite blocchi finali seleziona quindi i blocchi utilizzati per la risposta LLM.
ja: Rerankに送信して並べ替える融合検索チャンクの最大数。 例：検索で100チャンク見つかり、これが24に設定されている場合、上位24の融合チャンクのみがRerankに送信されます。最終チャンク制限でLLM回答に使用するチャンクが選択されます。
ko: 재순위화를 위해 보낼 최대 융합 검색 청크 수입니다. 예: 검색에서 100개의 청크를 찾고 이 값이 24로 설정된 경우, 상위 24개의 융합 청크만 재순위화에 전송됩니다. 그런 다음 최종 청크 제한이 LLM 답변에 사용될 청크를 선택합니다.
nl: Maximum aantal gefuseerde ophaalbrokken dat naar Rerank wordt gestuurd voor herordening. Voorbeeld: als ophalen 100 brokken vindt en dit is ingesteld op 24, worden alleen de top 24 gefuseerde brokken naar Rerank gestuurd. De uiteindelijke broklimiet selecteert vervolgens de brokken die voor het LLM-antwoord worden gebruikt.
pl: Maksymalna liczba połączonych fragmentów wysłanych do ponownego rankingu. Przykład: jeśli wyszukiwanie znajdzie 100 fragmentów, a to ustawienie wynosi 24, tylko 24 najlepsze połączone fragmenty są wysyłane do ponownego rankingu. Następnie limit końcowych fragmentów wybiera fragmenty używane do odpowiedzi LLM.
pt_br: Número máximo de fragmentos de recuperação combinados enviados ao Rerank para reordenação. Exemplo: se a recuperação encontrar 100 fragmentos e este valor for 24, apenas os 24 principais fragmentos combinados são enviados ao Rerank. O Limite Final de Fragmentos então seleciona os fragmentos usados para a resposta do LLM.
ru: Максимальное количество объединённых фрагментов, отправляемых на переранжирование. Пример: если поиск находит 100 фрагментов, а это значение равно 24, то только 24 лучших объединённых фрагмента отправляются на переранжирование. Затем «Лимит итоговых фрагментов» выбирает фрагменты для ответа LLM.
tr: Yeniden sıralama için gönderilen birleştirilmiş getiri parçalarının maksimum sayısı. Örnek: getiri 100 parça bulursa ve bu değer 24 olarak ayarlanmışsa, yalnızca ilk 24 birleştirilmiş parça Rerank'a gönderilir. Ardından Nihai Parça Limiti, LLM yanıtı için kullanılacak parçaları seçer.
uk: Максимальна кількість об'єднаних фрагментів пошуку, що надсилаються до Rerank для перевпорядкування. Приклад: якщо пошук знаходить 100 фрагментів, а це значення встановлено на 24, лише 24 найкращі об'єднані фрагменти надсилаються до Rerank. Потім ліміт остаточних фрагментів вибирає фрагменти для відповіді LLM.
vi: Số lượng tối đa các khối truy xuất hợp nhất được gửi đến Rerank để sắp xếp lại. Ví dụ: nếu truy xuất tìm thấy 100 khối và giá trị này được đặt thành 24, chỉ 24 khối hợp nhất hàng đầu được gửi đến Rerank. Giới hạn khối cuối cùng sau đó chọn các khối được sử dụng cho câu trả lời LLM.
zh_hans: 最多将多少条综合检索分片发送给 Rerank 重新排序。 示例：检索到 100 条分片时，若设为 24，则只发送综合排序靠前的 24 条给 Rerank；重排后再按“最终分片上限”选取分片供 LLM 回答。
zh_hant: 最多將多少條綜合檢索分片傳送給 Rerank 重新排序。 範例：檢索到 100 條分片時，若設為 24，則只傳送綜合排序前 24 條給 Rerank；重排後再按「最終分片上限」選取分片供 LLM 回答。

# rag.workspace.rerank.enabled
source: Enable
ar: تمكين
de: Aktivieren
es: Activar
fr: Activer
id: Aktifkan
it: Abilita
ja: 有効
ko: 활성화
nl: Inschakelen
pl: Włącz
pt_br: Ativar
ru: Включить
tr: Etkinleştir
uk: Увімкнути
vi: Bật
zh_hans: 启用
zh_hant: 啟用

# rag.workspace.rerank.enabled.hint
source: When enabled, candidate chunks are sent to your configured rerank service before final chunk selection.
ar: عند التمكين، تُرسل الأجزاء المُرشحة إلى خدمة إعادة الترتيب المُعدّة قبل اختيار الأجزاء النهائي.
de: Wenn aktiviert, werden Kandidaten-Chunks vor der endgültigen Chunk-Auswahl an Ihren konfigurierten Rerank-Dienst gesendet.
es: Cuando está activado, los fragmentos candidatos se envían al servicio de rerank configurado antes de la selección final de fragmentos.
fr: Lorsque activé, les fragments candidats sont envoyés à votre service de reclassement configuré avant la sélection finale des fragments.
id: Saat diaktifkan, potongan kandidat dikirim ke layanan rerank yang dikonfigurasi sebelum pemilihan potongan akhir.
it: Quando abilitato, i blocchi candidati vengono inviati al servizio di rerank configurato prima della selezione finale dei blocchi.
ja: 有効にすると、最終チャンク選択の前に候補チャンクが設定されたRerankサービスに送信されます。
ko: 활성화하면 최종 청크 선택 전에 후보 청크가 구성된 재순위화 서비스로 전송됩니다.
nl: Indien ingeschakeld, worden kandidaatbrokken naar uw geconfigureerde herordeningsservice gestuurd voordat de uiteindelijke brokselectie plaatsvindt.
pl: Gdy włączone, fragmenty kandydujące są wysyłane do skonfigurowanej usługi ponownego rankingu przed ostatecznym wyborem fragmentów.
pt_br: Quando ativado, os fragmentos candidatos são enviados ao serviço de rerank configurado antes da seleção final dos fragmentos.
ru: При включении фрагменты-кандидаты отправляются в настроенную службу переранжирования перед окончательным выбором.
tr: Etkinleştirildiğinde, aday parçalar nihai parça seçiminden önce yapılandırılmış yeniden sıralama hizmetinize gönderilir.
uk: Якщо увімкнено, фрагменти-кандидати надсилаються до налаштованої служби переранжування перед остаточним вибором фрагментів.
vi: Khi được bật, các khối ứng viên được gửi đến dịch vụ rerank đã cấu hình trước khi chọn khối cuối cùng.
zh_hans: 启用后，候选分片会先发送到配置的 Rerank 服务，再选择最终分片。
zh_hant: 啟用後，候選分片會先傳送到設定的 Rerank 服務，再選取最終分片。

# rag.workspace.rerank.endpoint
source: Endpoint
ar: نقطة النهاية
de: Endpunkt
fr: Point d'accès
ja: エンドポイント
ko: 엔드포인트
nl: Eindpunt
pl: Punkt końcowy
ru: Конечная точка
tr: Uç Nokta
uk: Кінцева точка
vi: Điểm cuối
zh_hans: 服务地址
zh_hant: 服務端點
